docs/posts/functor.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-09 Fri 17:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Samuel Evans-Powell</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Samuel Evans-Powell" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
</head>
<body>
<div id="content">
<h1 class="title">Samuel Evans-Powell</h1>
<p>
<a id="orga5f3024"></a>
<a href="../index.html">&lt; Home</a>
</p>

<div id="outline-container-org9e1ea57" class="outline-2">
<h2 id="org9e1ea57">Functor</h2>
<div class="outline-text-2" id="text-org9e1ea57">
<p>
<i>I've been learning about Haskell and Category Theory lately. In this</i>
<i>series of posts I hope to collect my thoughts. Please pop me an email or open a</i>
<i>pull request <a href="https://github.com/sevanspowell/sevanspowell">here</a> if you want to make any suggestions/corrections, I'm still</i>
<i>learning myself.</i>
</p>

<p>
A data type that is an instance of Functor allows you to apply some function to
values <i>within the context of</i> that Functor (a list of Integers can be thought
of as Integer values <i>within the context of</i> a list). You're probably familiar
with at least one instance of Functor: the List type in Haskell. The List type
allows functions to be applied to values in the list using the <code>map</code> function:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">map</span> <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">(</span>a <span style="color: #715ab1;">-&gt;</span> b<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3;">[</span>a<span style="color: #3a81c3;">]</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3;">[</span>b<span style="color: #3a81c3;">]</span>
</pre>
</div>

<p>
In Haskell, for a type to be a Functor instance, it must implement the <code>fmap</code>
function:
</p>

<div class="aside">
<p>
Note that <code>fmap</code> is just a generalization of the <code>map</code> function, with the list
being replaced by the type parameter <code>f</code>.
</p>

</div>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">fmap</span> <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">(</span>a <span style="color: #715ab1;">-&gt;</span> b<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> f a <span style="color: #715ab1;">-&gt;</span> f b
</pre>
</div>

<p>
That's it! Just one function.
</p>

<p>
The <code>fmap</code> function can be thought of as 'mapping' values of the type 'a' in the
given functor (the domain) to values of the type 'b' in the same functor
(codomain), where the given function <code>(a -&gt; b)</code> performs that 'mapping'.
</p>

<p>
A simple Functor instance for Lists might look like this:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">instance</span> <span style="color: #ba2f59; font-weight: bold;">Functor</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">List</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3; font-weight: bold;">where</span>
  fmap <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">(</span>a <span style="color: #715ab1;">-&gt;</span> b<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3;">[</span>a<span style="color: #3a81c3;">]</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3;">[</span>b<span style="color: #3a81c3;">]</span>
  fmap <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #3a81c3; font-weight: bold;">[]</span>     <span style="color: #715ab1;">=</span> <span style="color: #3a81c3; font-weight: bold;">[]</span>
  fmap f <span style="color: #3a81c3;">(</span>x<span style="color: #ba2f59; font-weight: bold;">:</span>xs<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">=</span> f x <span style="color: #ba2f59; font-weight: bold;">:</span> fmap xs
</pre>
</div>

<p>
The supplied function is simply applied to each element in the list.
</p>

<p>
The Haskell Maybe type is also an instance of Functor:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">instance</span> <span style="color: #ba2f59; font-weight: bold;">Functor</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Maybe</span><span style="color: #3a81c3;">)</span> <span style="color: #3a81c3; font-weight: bold;">where</span>
  fmap <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">(</span>a <span style="color: #715ab1;">-&gt;</span> b<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> a <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> b
  fmap <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #ba2f59; font-weight: bold;">Nothing</span>  <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Nothing</span>
  fmap f <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Just</span> a<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">Just</span> <span style="color: #3a81c3;">(</span>f a<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Again, pretty simple: if the given Maybe has the value 'Nothing', return
'Nothing', otherwise apply the function to the value present.
</p>

<p>
Alright, how about something a bit more challenging:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">instance</span> <span style="color: #ba2f59; font-weight: bold;">Functor</span> <span style="color: #3a81c3;">(</span><span style="color: #6c3163; font-weight: bold;">(</span><span style="color: #ba2f59; font-weight: bold;">-&gt;</span><span style="color: #6c3163; font-weight: bold;">)</span> e<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3; font-weight: bold;">where</span>
</pre>
</div>

<p>
The function type constructor can be an instance of Functor too!
</p>

<p>
Yes, this can be very hard to wrap your head around. If you get lost here, don't
worry! Come back to it later.
</p>
</div>

<div id="outline-container-org95669f7" class="outline-3">
<h3 id="org95669f7">Kinds</h3>
<div class="outline-text-3" id="text-org95669f7">
<p>
Let's start with an aside on <i>kinds</i>:
</p>

<p>
Just as types are used to classify values, kinds are used to classify types.
</p>

<p>
The kind of Bool is '&lowast;':
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #ba2f59; font-weight: bold;">:</span>k <span style="color: #ba2f59; font-weight: bold;">Bool</span> 
<span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">::</span> <span style="color: #715ab1;">*</span>
</pre>
</div>

<p>
The kind of Integer is '&lowast;':
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #ba2f59; font-weight: bold;">:</span>k <span style="color: #ba2f59; font-weight: bold;">Integer</span>
<span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">::</span> <span style="color: #715ab1;">*</span>

<span style="color: #ba2f59; font-weight: bold;">:</span>k <span style="color: #3a81c3;">[</span><span style="color: #ba2f59; font-weight: bold;">Integer</span><span style="color: #3a81c3;">]</span>
<span style="color: #3a81c3;">[</span><span style="color: #ba2f59; font-weight: bold;">Integer</span><span style="color: #3a81c3;">]</span> <span style="color: #715ab1;">::</span> <span style="color: #715ab1;">*</span>
</pre>
</div>

<p>
If something can be used as a value, it's type will have the kind '&lowast;'.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #ba2f59; font-weight: bold;">:</span>t <span style="color: #ba2f59; font-weight: bold;">True</span>
<span style="color: #ba2f59; font-weight: bold;">True</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span>

<span style="color: #ba2f59; font-weight: bold;">:</span>k <span style="color: #ba2f59; font-weight: bold;">Bool</span>
<span style="color: #ba2f59; font-weight: bold;">Bool</span> <span style="color: #715ab1;">::</span> <span style="color: #715ab1;">*</span>
</pre>
</div>

<p>
True is a value whose type (Bool) has the kind '&lowast;'.
</p>

<p>
Type constructors on the other hand have the kind '(&lowast; -&gt; &lowast;)':
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #ba2f59; font-weight: bold;">:</span>k <span style="color: #3a81c3; font-weight: bold;">[]</span>
<span style="color: #3a81c3; font-weight: bold;">[]</span> <span style="color: #715ab1;">::</span> <span style="color: #715ab1;">*</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #715ab1;">*</span>

<span style="color: #ba2f59; font-weight: bold;">:</span>k <span style="color: #ba2f59; font-weight: bold;">Maybe</span>
<span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #715ab1;">::</span> <span style="color: #715ab1;">*</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #715ab1;">*</span>
</pre>
</div>

<p>
They take something of kind '&lowast;' (Such as Integer, [Integer], Bool, Maybe
Integer, etc.) and produce something of kind '&lowast;'. That is, it takes a value
type and produces a new value type.
</p>

<p>
The Maybe type takes any type of kind '&lowast;' and produces a value of a type whose
kind is '&lowast;':
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #ba2f59; font-weight: bold;">:</span>k <span style="color: #ba2f59; font-weight: bold;">Maybe</span>
<span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #715ab1;">::</span> <span style="color: #715ab1;">*</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #715ab1;">*</span>

<span style="color: #ba2f59; font-weight: bold;">:</span>k <span style="color: #ba2f59; font-weight: bold;">Int</span>
<span style="color: #ba2f59; font-weight: bold;">Int</span> <span style="color: #715ab1;">::</span> <span style="color: #715ab1;">*</span>

<span style="color: #ba2f59; font-weight: bold;">:</span>k <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>
<span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #ba2f59; font-weight: bold;">Int</span> <span style="color: #715ab1;">::</span> <span style="color: #715ab1;">*</span>
</pre>
</div>

<p>
The function type constructor takes two things of kind '&lowast;' and produces something
of kind '&lowast;':
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #ba2f59; font-weight: bold;">:</span>k <span style="color: #3a81c3; font-weight: bold;">(</span><span style="color: #ba2f59; font-weight: bold;">-&gt;</span><span style="color: #3a81c3; font-weight: bold;">)</span>
<span style="color: #3a81c3; font-weight: bold;">(</span><span style="color: #ba2f59; font-weight: bold;">-&gt;</span><span style="color: #3a81c3; font-weight: bold;">)</span> <span style="color: #715ab1;">::</span> <span style="color: #715ab1;">*</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #715ab1;">*</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #715ab1;">*</span>

<span style="color: #ba2f59; font-weight: bold;">:</span>k <span style="color: #3a81c3;">(</span><span style="color: #6c3163; font-weight: bold;">(</span><span style="color: #ba2f59; font-weight: bold;">-&gt;</span><span style="color: #6c3163; font-weight: bold;">)</span> <span style="color: #ba2f59; font-weight: bold;">Integer</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #6c3163; font-weight: bold;">(</span><span style="color: #ba2f59; font-weight: bold;">-&gt;</span><span style="color: #6c3163; font-weight: bold;">)</span> <span style="color: #ba2f59; font-weight: bold;">Integer</span><span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">::</span> <span style="color: #715ab1;">*</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #715ab1;">*</span>

<span style="color: #ba2f59; font-weight: bold;">:</span>k <span style="color: #3a81c3;">(</span><span style="color: #6c3163; font-weight: bold;">(</span><span style="color: #ba2f59; font-weight: bold;">-&gt;</span><span style="color: #6c3163; font-weight: bold;">)</span> <span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #6c3163; font-weight: bold;">(</span><span style="color: #ba2f59; font-weight: bold;">-&gt;</span><span style="color: #6c3163; font-weight: bold;">)</span> <span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span><span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">::</span> <span style="color: #715ab1;">*</span>

<span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Rewritten with (-&gt;) infix:</span>
<span style="color: #ba2f59; font-weight: bold;">:</span>k <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Integer</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Bool</span><span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">::</span> <span style="color: #715ab1;">*</span>
</pre>
</div>

<div class="aside">
<p>
Oh look, functions have the same kind as any other values!
</p>

</div>

<p>
Now, let's look at the kind of Functor.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #715ab1;">$</span> <span style="color: #ba2f59; font-weight: bold;">:</span>k <span style="color: #ba2f59; font-weight: bold;">Functor</span>
<span style="color: #ba2f59; font-weight: bold;">Functor</span> <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">*</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #715ab1;">*</span><span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Constraint</span>
</pre>
</div>

<p>
We can see that Functor takes something of kind '(&lowast; -&gt; &lowast;)' (i.e. a type
constructor) and produces a Constraint. We won't look at constraints now, but
the name should give you a sufficient idea of what they do.
</p>

<p>
It makes sense that we can create a Functor instance of Maybe because the
kind of Maybe matches:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #ba2f59; font-weight: bold;">:</span>k <span style="color: #ba2f59; font-weight: bold;">Maybe</span>
<span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #715ab1;">::</span> <span style="color: #715ab1;">*</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #715ab1;">*</span>

<span style="color: #3a81c3; font-weight: bold;">instance</span> <span style="color: #ba2f59; font-weight: bold;">Functor</span> <span style="color: #ba2f59; font-weight: bold;">Maybe</span> <span style="color: #3a81c3; font-weight: bold;">where</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">...</span>
</pre>
</div>

<p>
But, notice that the kind of <code>((-&gt;) e)</code> (where <code>e</code> is any type) also matches:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #ba2f59; font-weight: bold;">:</span>k <span style="color: #3a81c3;">(</span><span style="color: #6c3163; font-weight: bold;">(</span><span style="color: #ba2f59; font-weight: bold;">-&gt;</span><span style="color: #6c3163; font-weight: bold;">)</span> <span style="color: #ba2f59; font-weight: bold;">Integer</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3;">(</span><span style="color: #6c3163; font-weight: bold;">(</span><span style="color: #ba2f59; font-weight: bold;">-&gt;</span><span style="color: #6c3163; font-weight: bold;">)</span> <span style="color: #ba2f59; font-weight: bold;">Integer</span><span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">::</span> <span style="color: #715ab1;">*</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #715ab1;">*</span>
</pre>
</div>

<p>
Therefore, we can make Functor instances of <code>((-&gt;) e)</code>, i.e. the function type
constructor with one argument applied.
</p>

<p>
To make such an instance, we need an implementation of the <code>fmap</code> function:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">fmap</span> <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">(</span>a <span style="color: #715ab1;">-&gt;</span> b<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> f a <span style="color: #715ab1;">-&gt;</span> f b
</pre>
</div>

<p>
Let's substitute <code>f</code> for our function type constructor, <code>((-&gt;) e)</code>:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">fmap</span> <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">(</span>a <span style="color: #715ab1;">-&gt;</span> b<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3;">(</span><span style="color: #6c3163; font-weight: bold;">(</span><span style="color: #ba2f59; font-weight: bold;">-&gt;</span><span style="color: #6c3163; font-weight: bold;">)</span> e a<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3;">(</span><span style="color: #6c3163; font-weight: bold;">(</span><span style="color: #ba2f59; font-weight: bold;">-&gt;</span><span style="color: #6c3163; font-weight: bold;">)</span> e b<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
And writing <code>(-&gt;)</code> infix:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">fmap</span> <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">(</span>a <span style="color: #715ab1;">-&gt;</span> b<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3;">(</span>e <span style="color: #715ab1;">-&gt;</span> a<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3;">(</span>e <span style="color: #715ab1;">-&gt;</span> b<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Now that we have the type, let's try our hand at writing it (just match the
types!):
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #6c3163; font-weight: bold;">fmap</span> <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">(</span>a <span style="color: #715ab1;">-&gt;</span> b<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3;">(</span>e <span style="color: #715ab1;">-&gt;</span> a<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3;">(</span>e <span style="color: #715ab1;">-&gt;</span> b<span style="color: #3a81c3;">)</span>
<span style="color: #6c3163; font-weight: bold;">fmap</span> f g <span style="color: #715ab1;">=</span> f <span style="color: #715ab1;">.</span> g
</pre>
</div>

<p>
(Convince yourself that this works). Hmm, this is just function composition and
so can be re-written pointfree as:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">instance</span> <span style="color: #ba2f59; font-weight: bold;">Functor</span> <span style="color: #3a81c3;">(</span><span style="color: #6c3163; font-weight: bold;">(</span><span style="color: #ba2f59; font-weight: bold;">-&gt;</span><span style="color: #6c3163; font-weight: bold;">)</span> e<span style="color: #3a81c3;">)</span> <span style="color: #3a81c3; font-weight: bold;">where</span>
  fmap <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">(</span>a <span style="color: #715ab1;">-&gt;</span> b<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3;">(</span>e <span style="color: #715ab1;">-&gt;</span> a<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3;">(</span>e <span style="color: #715ab1;">-&gt;</span> b<span style="color: #3a81c3;">)</span>
  fmap <span style="color: #715ab1;">=</span> <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">.</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Phew, our Functor instance for the function type constructor. Essentially this
allows us to apply a function to the resulting value of another function
(function composition).
</p>

<p>
I hope this also demonstrates the power of 'following the types' of functions
(and kinds of types) when trying to understand functional programs. Do this
often!
</p>
</div>
</div>

<div id="outline-container-org7e6cf8b" class="outline-3">
<h3 id="org7e6cf8b">References</h3>
<div class="outline-text-3" id="text-org7e6cf8b">
<p>
[1] B. Yorgey, "Functors", <a href="http://www.seas.upenn.edu/~cis194/spring13/lectures/09-functors.html">http://www.seas.upenn.edu/~cis194/spring13/lectures/09-functors.html</a>, 2013. [Online]. Available: <a href="http://www.seas.upenn.edu/~cis194/spring13/lectures/09-functors.html">http://www.seas.upenn.edu/~cis194/spring13/lectures/09-functors.html</a>. [Accessed: 01- Feb- 2018].
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Samuel Evans-Powell</p>
<p class="date">Created: 2018-02-09 Fri 17:35</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
